app/Controllers/ClienteController.php

SELECT *
FROM `clientes`
---
    public function controle()
    {
        $clienteModel = new ClienteModel();
        $data['clientes'] = $clienteModel->findAll(); // Busca todos os registros

SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '1'
---
    public function editar($id)
{
    $clienteModel = new ClienteModel();

    if ($this->request->getMethod() === 'post') {
        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $data = [
            'nome'     => $this->request->getPost('nome'),
            'email'    => $this->request->getPost('email'),
            'telefone' => $this->request->getPost('telefone'),
            'endereco' => $this->request->getPost('endereco'),
            'cpf'      => $this->request->getPost('cpf'),
        ];

        if ($clienteModel->update($id, $data)) {
            return redirect()->to('/cliente/controle')->with('success', 'Cliente atualizado com sucesso!');
        } else {
            return redirect()->back()->withInput()->with('error', 'Falha ao atualizar o cliente.');
        }
    }

    $data['cliente'] = $clienteModel->find($id);