app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'erica'
AND `password` = 'teste'
 LIMIT 1
---
public function authenticate() {
$username = $this->request->getPost('username');
$password = $this->request->getPost('password');

$user = $this->userModel->where('username', $username)->where('password', $password)->first();